src/cf/InformationRegisters/СредняяЗарплатаПоРегионамИОКВЭД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СредняяЗарплатаПоРегионамИОКВЭД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СредняяЗарплата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодРегиона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодОКВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/КлассификаторОКВЭД2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КлассификаторОКВЭД2</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СредняяЗарплатаПоРегионамИОКВЭД/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает величину средней зарплаты по переданным коду региона, коду ОКВЭД и дате.
//
// Параметры:
//  КодРегиона - Строка - код субъекта РФ, для которого нужно получить данные.
//  КодОКВЭД - Строка - код вида деятельности, для которого нужно получить данные.
//  Дата - Дата - дата, на которую необходимо получить данные.
// Возвращаемое значение:
//  Неопределено - данные не найдены.
//  Число - величина средней зарплаты.
//
Функция ВеличинаЗарплаты(КодРегиона, КодОКВЭД, Дата) Экспорт
	
	ГодДанных = Год(Дата);
	ИерархияКодовОКВЭД = РегистрыСведений.КлассификаторОКВЭД2.КодВИерархии(КодОКВЭД);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(СредняяЗарплатаПоРегионамИОКВЭД.Год) КАК Год
	|ПОМЕСТИТЬ ГодПолученияДанных
	|ИЗ
	|	РегистрСведений.СредняяЗарплатаПоРегионамИОКВЭД КАК СредняяЗарплатаПоРегионамИОКВЭД
	|ГДЕ
	|	СредняяЗарплатаПоРегионамИОКВЭД.Год <= &ГодДанных
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	СредняяЗарплатаПоРегионамИОКВЭД.СредняяЗарплата КАК СредняяЗарплата
	|ИЗ
	|	РегистрСведений.СредняяЗарплатаПоРегионамИОКВЭД КАК СредняяЗарплатаПоРегионамИОКВЭД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГодПолученияДанных КАК ГодПолученияДанных
	|		ПО СредняяЗарплатаПоРегионамИОКВЭД.Год = ГодПолученияДанных.Год
	|ГДЕ
	|	СредняяЗарплатаПоРегионамИОКВЭД.КодРегиона = &КодРегиона
	|	И СредняяЗарплатаПоРегионамИОКВЭД.КодОКВЭД В(&СписокОКВЭД)
	|
	|УПОРЯДОЧИТЬ ПО
	|	СредняяЗарплатаПоРегионамИОКВЭД.КодОКВЭД УБЫВ";
	
	Запрос.УстановитьПараметр("ГодДанных", ГодДанных);
	Запрос.УстановитьПараметр("КодРегиона", КодРегиона);
	Запрос.УстановитьПараметр("СписокОКВЭД", ИерархияКодовОКВЭД);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СредняяЗарплата;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// См. РаботаСКлассификаторамиПереопределяемый.ПриДобавленииКлассификаторов.
//
Процедура ПриДобавленииКлассификаторов(Классификаторы) Экспорт
	
	Описатель = РаботаСКлассификаторами.ОписаниеКлассификатора();
	Описатель.Наименование = НСтр("ru = 'Средняя зарплата по регионам и ОКВЭД'");
	Описатель.Идентификатор = ИдентификаторВСервисеКлассификаторов();
	
	Классификаторы.Добавить(Описатель);
	
КонецПроцедуры

// См. РаботаСКлассификаторамиПереопределяемый.ПриЗагрузкеКлассификатора.
//
Процедура ПриЗагрузкеКлассификатора(Идентификатор, Версия, Адрес, Обработан) Экспорт
	
	Если Идентификатор <> ИдентификаторВСервисеКлассификаторов() Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(Адрес);
		Поток = ДвоичныеДанные.ОткрытьПотокДляЧтения();
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.ОткрытьПоток(Поток);
		ДанныеКлассификатора = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
		ЗаписатьДанные(ДанныеКлассификатора);
		Обработан = Истина;
		
	Исключение
		
		Обработан = Ложь;
		ЗаписьЖурналаРегистрации("ЗагрузкаКлассификатора",
			УровеньЖурналаРегистрации.Ошибка, 
			Метаданные.РегистрыСведений.СредняяЗарплатаПоРегионамИОКВЭД, ,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьДанные(ДанныеКлассификатора)
	
	ТипЧисло = Тип("Число");
	Набор = РегистрыСведений.СредняяЗарплатаПоРегионамИОКВЭД.СоздатьНаборЗаписей();
	Для каждого Элемент Из ДанныеКлассификатора.classifierData Цикл
		
		ЧастиСтроки = СтрРазделить(Элемент, ";", Истина);
		Год = XMLЗначение(ТипЧисло, ЧастиСтроки[0]);
		КодРегиона = ЧастиСтроки[1];
		КодОКВЭД = ЧастиСтроки[2];
		СредняяЗарплата = XMLЗначение(ТипЧисло, ЧастиСтроки[3]);
		
		Запись = Набор.Добавить();
		Запись.Год = Год;
		Запись.КодРегиона = КодРегиона;
		Запись.КодОКВЭД = КодОКВЭД;
		Запись.СредняяЗарплата = СредняяЗарплата;
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Истина);
	Набор.Записать();
	
КонецПроцедуры

Функция ИдентификаторВСервисеКлассификаторов()

	Возврат "AverageSalaryByRegionAndOKVED";

КонецФункции

#КонецОбласти

#КонецЕсли
